<?php
	$this->pageTitle = "Как да използваме сайта";
?>
<style type="text/css" xmlns="http://www.w3.org/1999/html">
    span.note {border-bottom: 1px dotted #aaa;}
	.moredetails {border-bottom:1px dashed #aaa;}
	.explanation { display:none; position:absolute; width:200px; padding:20px; background:#eee; border:1px solid #ccc;}
	img.illu {display:block; margin:20px 0; padding:10px; border:1px dashed #aaa;}
</style>

<script type="text/javascript">
$(function() {
	$("span[rel=popover]").popover();
});
</script>
<h1>Как да използваме сайта</h1>

<h2>Идея</h2>
<p>
	Преводачницата е устроена <span class="note" title="не много">много</span> просто. Тук може да се вземе текст
	на някакъв език, да се разбие на малки фрагменти и да се публикува. После
	<span class="note" title="или не различни, а онези, които вие самите внимателно ще подберете">разни обиковени</span>
	хора ще дойдат, ще погледнат тези фрагменти и, ако няма какво друго да правят, ще вземат да преведат някои от тях.
	После ще <span title="Пуф-ф-ф!">изпуфтят</span> от удоволствие и ще преведат още няколко. А после още и още.
	Ако някой смята, че даден фрагмент е преведен лошо, може да предложи свой вариант.
	А друг такъв случаен минувач може да прегледа два, три, десет различни превода на един
	фрагмент от текста, да избере онзи, който му е харесал най-много и, извинете за израза, да го „лайкне“.
<p><p></p>
	От най-„лайкнатите“ версии се създава крайният превод, който може да бъде свален като текстов файл
	<span title="залагам десетачка, че когато започнат да се поддържат нови формати, никой няма да си мръдне пръста да поправи помощния файл.">или</span>
	<span class="note" title="Сега са достъпни форматите SRT, SUB и SAMI">файл със субтитри за филма,</span>
	който може да бъде зареден в
	<a href="http://videolan.org/vlc" title="Това не е единственият добър плейър, но препоръчваме именно него." rel='nofollow'>медиа плейъра</a>
	и
	<span class="note" rel="popover" data-content="Общо взето, този модел на работа е подходящ за два взаимно изключващи се варианта:<br /><br />
		<ol>
		<li>Искате какъвто и да е превод, само да е по-бързо</li>
		<li>Ако ще и след година да е, но текстът да е бижу</li>
		</ol><br />
		Тук може да се работи и по двата начина. А как да стане това — четете по-нататък.
		А насладата е доста лабилно усещане." data-title="Ако трябва да сме сериозни">да се насладите</span>
	на автентичните реплики на актьорите заедно с добър и смислен превод.
</p>


<h2>Проект за превод</h2>
<p>
	Да <a href="/book/0/edit">създава</a> проект за перевод може всеки <a href="/register">регистриран</a> потребител на Преводачницата.
	Преди да създадете нов проект, е добре да <a href="/search">потърсите</a> дали нужният ви текст вече не се превежда.
	Празните преводи (където няма зареден текст на оригинала) могат да бъдат премахнати от сайта.
</p>
<p>
	За удобство, превежданият текст може да бъде разбит на части, които поради някаква неизвестна причина наричаме „глави“. Глава може да бъде
	глава от роман, епизод от сериал, текст файл за локализация на програма и т.н. Във всяка глава се зарежда
	разбитият на <i>фрагменти</i> оригинален текст.
</p>
<p>
	Преводът се извършва в главите. Всичко е много прости: отляво са <i>фрагментите от оригинала</i>, отдясно — <i>версиите на перевода</i>.
	<img src="/i/help/translate.png" class="illu" width="935" height="165" />
	За да добавите версия на превода, трябва да натиснете червената стрелка <span style="color:#c00; letter-spacing: -1px;">&raquo;&raquo;&raquo;</span>.
	Цифрите до версиите са рейтинг на превода. Ако преводът ви харесва, преместете курсора на мишката върху него и натиснете появилия се символ „+“.
	Приискало ви се е да поговорите? На вашите услуги са коментари към всеки фрагмент от оригинала, отварящи се чрез натискане на бутона <i class="icon-nb-comment"></i>.
	Е, да — за да можете изцяло да се насладите на тези интерактивни прелести, ще се наложи да се <a href="/register">регистрирате</a>. Нерегистрираните
	потребители могат само да четат и свалят преводи.
</p>

<h2>Права за достъп</h2>
<p>
	Преводачницата позволява гъвкаво да настройвате правата за достъп до превода, посочвайки какви <i>категории потребители</i>
	могат да извършват различните <i>действия</i>. В момента действията са 13 броя и най-важните 6 от тях са обозначени с икони:
</p>
<ol>
	<li><i class="ac_read"></i> <u>Влизане</u> в превод. Най-главното действие, което определя кой изобщо може да влезе на някоя страница от проекта за превод. Ако забраните на някой да влиза в превода, той няма да може да прави нищо повече с него.</li>
	<li><i class="ac_trread"></i> <u>Виждане чуждите версии</u> на превода. Потребителите, които нямат право да виждат чуждите версии, ще виждат само версиите, които са добавили сами.</li>
	<li><i class="ac_gen"></i> <u>Сваляне на резултата</u> от перевода като текстов файл или файл със субтитри.</li>
	<li><i class="ac_rate"></i> <u>Оценяване на превода</u>. В момента потребителите, които имат право да оценяват превода, могат да поставят на чуждите версии на превода само „плюсове“. „Минуси“ могат да поставят само модераторите, но тази политика може да бъде променена в бъдеще.</li>
	<li><i class="ac_comment"></i> <u>Коментиране на превода</u>.</li>
	<li><i class="ac_tr"></i> <u>Превеждане</u>, тоест, да добавяте свои версии на преводите на фрагментите от оригинала.</li>
	<li><u>Четене блога на превода</u>.</li>
	<li><u>Коментиране на съобщения в блога</u>.</li>
	<li><u>Писане на съобщения в блога</u>.</li>
	<li><u>Анонсиране на превода</u>. Анонсите на превода се публикуват в <a href="/announces">общата лента на анонсите</a>, а последните пет анонса се публикуват на <a href="/">главната страница</a> на сайта.</li>
	<li><u>Редактиране на оригинала</u> — добавяне и премахване на глави, редактиране на заглавието и статуса им, задаване на специални права за достъп до една глава от превода, импортиране на текст в оригинала, редактиране на фрагментите от оригинала.</li>
	<li><u>Редактиране описанието на превода</u>. Тези потребители могат да редактират името на превода, анотацията, да качват заглавна картинка, да избират раздел от каталога, където ще бъде поместен превода.</li>
	<li><u>Управление на група</u>. Потребителите, на които е разрешено да управляват т.нар. „група за превод“ могат да разглеждат заявки за встъпване в група, да отправят покани, да банват и гонят потребители. А за това, какво точно е „група за превод“, ще поговорим малко по-късно.</li>
</ol>
<p>
	За всяко от тези дейстивя може да се избере <i>категория потребители</i>. На съвременната наука са известни четири вида категории:
</p>
<ol>
	<li><u>Всички</u>. За онези действия, в резултат на които се променя състоянието на првода (поставяне на оценка, писане на коментар, добавяне на собствени версии и т.н.) „всички“ — това са всички регистрирани потребители. За действия от вида на четене на превода или блога не е нужна регистрация.</li>
	<li><u>Група</u>.
		Ограничен кръг от хора, определяни от създателя на проекта за превод или модератор. Има два начина да станете член на група за превод — да подадете заявка, която в последствие ще бъде приета или
		отхвърлена от <span class="note" title="Или от създателя на проекта; зависи от това на кого са зададени права за „управляване на група“">модераторите</span> на превода, или
		да получите лична покана от същите тези модератори. Правилата за встъпване в групата се определят от създателя на проекта за превод в редактора за права на достъп. В проекта може изобщо да няма група.
		Ако е избран режим на групата „след потвърждаване от модератор“, тогава в нея може да влезете като натиснете съответния бутон в страницата с участници в превода:
		<img src="/i/help/group-join.png" class="illu" width="590" height="291" />
	</li>
	<li>
		<u>Модератори</u>. Модераторите се назначават от собственика на проекта превод измежду членовете на групата, ако има такава, или измежду онези потребители, които са оставили поне една версия на превода, ако няма група.
		Освен действията, които са разрешени явно на модераторите, те винаги могат да редактират и да премахват произволни версии на превода и да им поставят отрицателни оценки.
	</li>
	<li><u>Никой</u>. От това „никой“ има едно-единствено изключение: създателят на проекта за превод. Той може всичко.</li>
</ol>
<p>
	Ако в превода има няколко глави, то за всяка от тях могат да се зададат права за достъп, различни от общите права в превода, но само за първите шест действия. Това може да е удобно,
	ако например превеждате серал, добавяйки новите епизоди като отделни глави и искате по време на превода на серията да ограничите достъпа до нея.
</p>

<h2>Нищо не разбрах!</h2>
<p>
	Най-добрият начин да получите отговор на вашия въпрос в Преводачницата, е да го <a href="/blog/edit?topic=65">зададете</a> в <a href="/blog?topic=65">специалния раздел</a> на нашия общ блог.
</p>
