<?php
	/**
	 * @var integer $topic
	 * @var Book $book
	 */
?>
<div class='tools'>
<h5>Анонси</h5>
	<p>Молим:</p>
	<ol>
		<li>Бъдете лаконични!</li>
		<li>Изберете най-подходящата рубрика.</li>
	</ol>
	<p>Помнете, че:</p>
	<ol>
		<li>Можете да пишете не повече от един анонс за денонощие.</li>
		<li>Повтарянето няколко дни на едно и също не се приветства.</li>
		<li>Анонсите не се трият.</li>
		<li>Анонсите на отворените преводи попадат на главната страница и в <a href="/announces">общата лента</a>. Това &ndash; е огромна отговорност пред милиарди читатели.</li>
		<li>Модераторите могат да променят или изтрият анонс на отворен превод, ако той противоречи на гореописаното.</li>
		<li>Има закономерност: честата намеса на модератори в анонсите ви води &ndash; до бан.</li>
	</ol>
</p>
</div>

